//1. Определяем и выводим на экран информацию о том, четное введенное число или нечетное

/*let number = +prompt("Введите любое число");
let compute = number % number;

if (compute == 0) {
  document.write("Вы ввели четное число");
} else {
  document.write("Вы ввели не - четное число");
}*/

//2. Пользователь вводит название месяца исходя из введенного названия месяца нужно вывести сообщение с названием времени года.
//Например:
//**Пользователь:** январь
//**Компьютер:** это зима

/*let month = prompt("Введите название месяца");

if (month == "январь" || month == "февраль" || month == "декабрь") {
  document.write("Это Зима!");
} else if (month == "март" || month == "апрель" || month == "май") {
  document.write("Это Весна!");
} else if (month == "июнь" || month == "июль" || month == "август") {
  document.write("Это Лето!");
} else {
  document.write("Это Осень!");
}*/

// 3. Определяем животное, ассоциированное с введенным годом в китайском гороскопе
/*Например:
 **Пользователь**: 2021
 **Компьютер**: Бык*/
