////////////////////////////////zadanie 1///////////////////////////////////////
/*1. Разработайте программу, запрашивающую у пользователя букву латинского алфавита. Если введенная буква входит в следующий список (a, e, i, o или u), необходимо вывести сообщение о том, что эта буква гласная. Если была введена буква **y**, программа должна написать, что эта буква может быть как гласной, так и согласной. Во всех других случаях должно выводиться сообщение о том, что введена согласная буква.
*/

/*let userDigit = prompt('Укажите букву латинского алфавита!')

switch (userDigit) {
	case 'a':
		console.log("Эта буква гласная!")
	break;

	case 'e':
		console.log("Эта буква гласная!")
	break;

	case 'i':
		console.log("Эта буква гласная!")
	break;

	case 'o':
		console.log("Эта буква гласная!")
	break;

	case 'u':
		console.log("Эта буква может быть как гласной, так и согласной!")
	break;

	default:
		console.log("Эта буква согласная!")
	break;
}*/

////////////////////////////////zadanie 2///////////////////////////////////////
//2. Напишите программу, запрашивающую у пользователя три целых числа и выводящую их в упорядоченном виде – по возрастанию.
/*
let userNumber1 = prompt('Введите целое число здесь!')
let userNumber2 = prompt('Введите второе целое число здесь!')
let userNumber3 = prompt('Введите третье число и получите их в упорядоченном виде – по возрастанию!')

let sortifier = [
	userNumber1, userNumber2, userNumber3
]

sortifier.sort(function(a,b) { 
	return a - b
})


console.log(sortifier);*/

////////////////////////////////zadanie 3///////////////////////////////////////
